import React from 'react';
import './recomendation.css';

const Recomendation = () => {
     return (
          <>
               <h2 className='titleRecomendation'>Рекомендации по питанию</h2>
               <ul className='recomendation'>
                    <li>
                         Качество, количество и кратность питания должно быть
                         комфортным в рамках калорийности и БЖУ.
                    </li>
                    <li>
                         Распределение углеводов:
                         Утро (короткие крахмалистые) - бездрожжевой хлеб, картофель, батат,
                         лаваш, лепешка, выпечка без сахара и дрожжей.
                         Обед (длинные крахмалистые) - рис, чечевица, фасоль, гречка,
                         нут, киноа, булгур, крупы).
                         Вечер (овощи) + ОБЯЗАТЕЛЬНО позволить себе любимый продукт
                         на 200-300 ккал (фрукты, натуральный шоколад, выпечка без дрожжей) в рамках калорийности
                         и БЖУ не позднее, чем за 2 часа до сна.
                    </li>
                    <li>
                         ОБЯЗАТЕЛЬНО употреблять в пищу больше клетчатки и щелочных продуктов: зелень, сельдерей , редис,
                         огурец, шпинат, цветная капуста и белокочанная, свекла, морковь, чеснок, водоросли, брокколи, авокадо, лимон.
                    </li>
                    <li>
                         В ДНИ ТРЕНИРОВОК дополнительно добавить 100 грамм углеводов за 120 минут до тренировки
                         за счет коротких крахмалистых углеводов (батат, картофель, бездрожжевой хлеб, лаваш, лепешка, выпечка без сахара и дрожжей).
                    </li>
                    <li>
                         ДОБАВЛЯТЬ В РАМКАХ КАЛОРИЙНОСТИ!!!
                         Например: вам необходимо съедать 150 грамм углеводов в сутки,
                         соответсвенно, 100 из них употреблять перед тренировкой, остальные распределять на день.
                    </li>
                    <li>
                         ВО ВРЕМЯ ТРЕНИРОВОК употреблять ИСКЛЮЧИТЕЛЬНО обычную воду
                         без различных ВСАА и аминокислот (по причине скачков инсулина, которые не нужны на тренировке).
                    </li>
                    <li>
                         Добавить 5-7 грамм соли в сутки (поваренная или йодированная)
                         СОКРАТИТЬ, а в идеале УБРАТЬ количество симуляторов: кофе, чай, табак, алкоголь.
                    </li>
                    <li>
                         Употреблять меньшее количество калорий НЕДОПУСТИМО.
                    </li>
                    <li>
                         Купить кухонные весы. Взвешивать крупы, овощи и остальные продукты в сыром виде.
                         Мясо, рыбу, птицу в готовом.
                    </li>
                    <li>
                         Обязательно учитывать БЖУ и калорийность пищевых добавок (пример Омега 3, 1 капсула = 1 грамм жира).
                    </li>
                    <li>
                         Отдавать предпочтение полиненасыщенным и
                         мононасыщеным жирам (омега 3, растительные масла, орехи, авокадо, семечки).
                    </li>
                    <li>
                         Соотношение углеводов, 30% фруктоза (фрукты, натуральный шоколад),
                         70% крахмалистые (рис, гречка, картошка, муха безглютеновая, хлебобулочные изделия без сахара и дрожжей).
                    </li>
                    <li>
                         В питании рекомендуется отдавать приоритет продуктам,
                         дающим щелочную реакцию, убрать или сократить до 1 приема пищи в день продукты,
                         дающие окислительную реакцию: птица, красное мясо, глютен, сахар, морепродукты.
                         Разрешаются фермерские яйца и фермерская молочная продукция. Питание с кислотностью 6.0 - 10.0 PH.
                    </li>
                    <li>
                         Допускаются к употреблению продукты животноводства либо свежеубитые, либо в вакуумной упаковке.
                         Исключить охлажденные и замороженные продукты животноводства.
                    </li>
                    <li>
                         Время и состав последнего приема пищи не принципиальны.
                    </li>
                    <li>
                         Наличие продукта,
                         который доставляет Вам психологическое удовольствие ЯВЛЯЕТСЯ ОБЯЗАТЕЛЬНЫМ,
                         в рамках калорийности и макрос (БЖУ).
                    </li>
                    <li>
                         При невозможности набрать суточную калорийность «ПРАВИЛЬНЫМИ» продуктами,
                         включаем максимально калорийные в рамках макрос (БЖУ).
                    </li>
                    <li>
                         Количество приемов пищи не принципиально,
                         питаться строго по аппетиту (распределить свою «пищевую корзину» на удобное для Вас количество приемов пищи).
                    </li>
                    <li>
                         Старайтесь распределять суточный объем жидкости равномерно в течении дня.
                    </li>
                    <li>
                         Овощи не учитывать в калорийность (кроме авокадо, свеклы, моркови, картошки, батата).
                    </li>
                    <li>
                         Возможно менять составляющие рациона в зависимости от собственных предпочтений в рамках макрос (БЖУ).
                    </li>
                    <li>
                         Задача минимум - вписываться в калорийность, задача максимум - вписываться в рамки макрос (БЖУ).
                    </li>
               </ul>
          </>
     )
}

export default Recomendation;